lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>ADC12CTL2</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>ADC12_B Control 2</description>
          <fields>
            <field>
              <name>ADC12PWRMD</name>
              <description>[0:0] low-power mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12PWRMD_0</name>
                  <value>0x0</value>
                  <description>Regular power mode where sample rate is not restricted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12PWRMD_1</name>
                  <value>0x1</value>
                  <description>Low power mode enable, ADC12CLK can not be greater than 1/4 the device-specific data sheet specified maximum for ADC12PWRMD = 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DF</name>
              <description>[3:3] data read-back format</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12DF_0</name>
                  <value>0x0</value>
                  <description>Binary unsigned. Theoretically for ADC12DIF = 0 and 12-bit mode the analog input voltage  VREF results in 0000h, the analog input voltage + VREF results in 0FFFh.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DF_1</name>
                  <value>0x1</value>
                  <description>Signed binary (2s complement), left aligned. Theoretically, for ADC12DIF = 0 and 12-bit mode, the analog input voltage  VREF results in 8000h, the analog input voltage + VREF results in 7FF0h.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12RES</name>
              <description>[5:4] resolution</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8BIT</name>
                  <value>0x0</value>
                  <description>8 bit (10 clock cycle conversion time)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT</name>
                  <value>0x1</value>
                  <description>10 bit (12 clock cycle conversion time)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12BIT</name>
                  <value>0x2</value>
                  <description>12 bit (14 clock cycle conversion time)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_3</name>
                  <value>0x3</value>
                  <description>Reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12CTL3</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>ADC12_B Control 3</description>
          <fields>
            <field>
              <name>ADC12CSTARTADD</name>
              <description>[4:0] conversion start address</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12MEM0</name>
                  <value>0x0</value>
                  <description>Conversion start address ADC12MEM0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM1</name>
                  <value>0x1</value>
                  <description>Conversion start address ADC12MEM1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM2</name>
                  <value>0x2</value>
                  <description>Conversion start address ADC12MEM2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM3</name>
                  <value>0x3</value>
                  <description>Conversion start address ADC12MEM3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM4</name>
                  <value>0x4</value>
                  <description>Conversion start address ADC12MEM4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM5</name>
                  <value>0x5</value>
                  <description>Conversion start address ADC12MEM5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM6</name>
                  <value>0x6</value>
                  <description>Conversion start address ADC12MEM6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM7</name>
                  <value>0x7</value>
                  <description>Conversion start address ADC12MEM7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM8</name>
                  <value>0x8</value>
                  <description>Conversion start address ADC12MEM8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM9</name>
                  <value>0x9</value>
                  <description>Conversion start address ADC12MEM9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM10</name>
                  <value>0xA</value>
                  <description>Conversion start address ADC12MEM10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM11</name>
                  <value>0xB</value>
                  <description>Conversion start address ADC12MEM10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM12</name>
                  <value>0xC</value>
                  <description>Conversion start address ADC12MEM12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM13</name>
                  <value>0xD</value>
                  <description>Conversion start address ADC12MEM13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM14</name>
                  <value>0xE</value>
                  <description>Conversion start address ADC12MEM14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM15</name>
                  <value>0xF</value>
                  <description>Conversion start address ADC12MEM15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM16</name>
                  <value>0x10</value>
                  <description>Conversion start address ADC12MEM16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM17</name>
                  <value>0x11</value>
                  <description>Conversion start address ADC12MEM17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM18</name>
                  <value>0x12</value>
                  <description>Conversion start address ADC12MEM18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM19</name>
                  <value>0x13</value>
                  <description>Conversion start address ADC12MEM19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM20</name>
                  <value>0x14</value>
                  <description>Conversion start address ADC12MEM20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM21</name>
                  <value>0x15</value>
                  <description>Conversion start address ADC12MEM21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM22</name>
                  <value>0x16</value>
                  <description>Conversion start address ADC12MEM22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM23</name>
                  <value>0x17</value>
                  <description>Conversion start address ADC12MEM23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM24</name>
                  <value>0x18</value>
                  <description>Conversion start address ADC12MEM24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM25</name>
                  <value>0x19</value>
                  <description>Conversion start address ADC12MEM25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM26</name>
                  <value>0x1A</value>
                  <description>Conversion start address ADC12MEM26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM27</name>
                  <value>0x1B</value>
                  <description>Conversion start address ADC12MEM27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM28</name>
                  <value>0x1C</value>
                  <description>Conversion start address ADC12MEM28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM29</name>
                  <value>0x1D</value>
                  <description>Conversion start address ADC12MEM29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM30</name>
                  <value>0x1E</value>
                  <description>Conversion start address ADC12MEM30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MEM31</name>
                  <value>0x1F</value>
                  <description>Conversion start address ADC12MEM31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12BATMAP</name>
              <description>[6:6] 1/2 AVCC ADC input channel selection</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12BATMAP_0</name>
                  <value>0x0</value>
                  <description>external pin is selected for ADC input channel A31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12BATMAP_1</name>
                  <value>0x1</value>
                  <description>ADC internal 1/2 x AVCC channel is selected for ADC input channel A31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12TCMAP</name>
              <description>[7:7] temperature sensor ADC input channel selection</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12TCMAP_0</name>
                  <value>0x0</value>
                  <description>external pin is selected for ADC input channel A30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12TCMAP_1</name>
                  <value>0x1</value>
                  <description>ADC internal temperature sensor channel is selected for ADC input channel A30</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ICH0MAP</name>
              <description>[8:8] int ch 0 sel to ADC in ch A29</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ICH0MAP_0</name>
                  <value>0x0</value>
                  <description>external pin is selected for ADC input channel A29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ICH0MAP_1</name>
                  <value>0x1</value>
                  <description>ADC input channel internal 0 is selected for ADC input channel A29, see device-specific data sheet for availability</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ICH1MAP</name>
              <description>[9:9] int ch 1 sel to ADC in ch A28</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ICH1MAP_0</name>
                  <value>0x0</value>
                  <description>external pin is selected for ADC input channel A28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ICH1MAP_1</name>
                  <value>0x1</value>
                  <description>ADC input channel internal 1 is selected for ADC input channel A28, see device-specific data sheet for availability</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ICH2MAP</name>
              <description>[10:10] int ch 2 sel to ADC in ch A27</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ICH2MAP_0</name>
                  <value>0x0</value>
                  <description>external pin is selected for ADC input channel A27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ICH2MAP_1</name>
                  <value>0x1</value>
                  <description>ADC input channel internal 2 is selected for ADC input channel A27, see device-specific data sheet for availability</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ICH3MAP</name>
              <description>[11:11] int ch 3 sel to ADC in ch A26</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ICH3MAP_0</name>
                  <value>0x0</value>
                  <description>external pin is selected for ADC input channel A26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ICH3MAP_1</name>
                  <value>0x1</value>
                  <description>ADC input channel internal 3 is selected for ADC input channel A26, see device-specific data sheet for availability</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12LO</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>ADC12_B Window Comparator Low Threshold Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12HI</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>ADC12_B Window Comparator High Threshold Register</description>
          <resetValue>0</resetValue>
        </register>
