lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>CECTL3</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>Comparator Control Register 3</description>
          <fields>
            <field>
              <name>CEPD0</name>
              <description>[0:0] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD0_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD0_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD1</name>
              <description>[1:1] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD1_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD1_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD2</name>
              <description>[2:2] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD2_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD2_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD3</name>
              <description>[3:3] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD3_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD3_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD4</name>
              <description>[4:4] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD4_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD4_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD5</name>
              <description>[5:5] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD5_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD5_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD6</name>
              <description>[6:6] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD6_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD6_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD7</name>
              <description>[7:7] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD7_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD7_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD8</name>
              <description>[8:8] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD8_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD8_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD9</name>
              <description>[9:9] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD9_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD9_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD10</name>
              <description>[10:10] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD10_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD10_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD11</name>
              <description>[11:11] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD11_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD11_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD12</name>
              <description>[12:12] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD12_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD12_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD13</name>
              <description>[13:13] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD13_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD13_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD14</name>
              <description>[14:14] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD14_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD14_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPD15</name>
              <description>[15:15] Port disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPD15_0</name>
                  <value>0x0</value>
                  <description>The input buffer is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPD15_1</name>
                  <value>0x1</value>
                  <description>The input buffer is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CEINT</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>Comparator Interrupt Control Register</description>
          <fields>
            <field>
              <name>CEIFG</name>
              <description>[0:0] Comparator output interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIIFG</name>
              <description>[1:1] Comparator output inverted interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CERDYIFG</name>
              <description>[4:4] Comparator ready interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CERDYIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERDYIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIE</name>
              <description>[8:8] Comparator output interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIIE</name>
              <description>[9:9] Comparator output interrupt enable inverted polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CERDYIE</name>
              <description>[12:12] Comparator ready interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CEIV</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>Comparator Interrupt Vector Word Register</description>
          <fields>
            <field>
              <name>CEIV</name>
              <description>[15:0] Comparator interrupt vector word register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: CEOUT interrupt; Interrupt Flag: CEIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: CEOUT interrupt inverted polarity; Interrupt Flag: CEIIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERDYIFG</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Comparator ready interrupt; Interrupt Flag: CERDYIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
