lukasl93/msp430fr5994/MSP430FR5994.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <baseAddress>0x0150</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CRCDI</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>CRC Data In</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRCDIRB</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>CRC Data In Reverse Byte</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRCINIRES</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>CRC Initialization and Result</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRCRESR</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>CRC Result Reverse</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC32</name>
      <baseAddress>0x0980</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CRC32DIW0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>CRC32 Data Input Word 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32DIW1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>CRC32 Data Input Word 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32DIRBW1</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>CRC32 Data In Reverse Word 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32DIRBW0</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>CRC32 Data In Reverse Word 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32INIRESW0</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>CRC32 Initialization and Result Word 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32INIRESW1</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>CRC32 Initialization and Result Word 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32RESRW1</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>CRC32 Result Reverse Word 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC32RESRW0</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>CRC32 Result Reverse Word 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC16DIW0</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>CRC16 Data Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC16DIRBW0</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>CRC16 Data In Reverse</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC16INIRESW0</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>CRC16 Init and Result</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC16RESRW0</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>CRC16 Result Reverse</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CS</name>
      <baseAddress>0x0160</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Clock System Control 0</description>
          <fields>
            <field>
              <name>CSKEY</name>
              <description>[15:8] CSKEY password</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSCTL1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Clock System Control 1</description>
          <fields>
            <field>
              <name>DCOFSEL</name>
              <description>[3:1] DCO frequency select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFSEL_0</name>
                  <value>0x0</value>
                  <description>If DCORSEL = 0: 1 MHz; If DCORSEL = 1: 1 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_1</name>
                  <value>0x1</value>
                  <description>If DCORSEL = 0: 2.67 MHz; If DCORSEL = 1: 5.33 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_2</name>
                  <value>0x2</value>
                  <description>If DCORSEL = 0: 3.33 MHz; If DCORSEL = 1: 6.67 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_3</name>
                  <value>0x3</value>
                  <description>If DCORSEL = 0: 4 MHz; If DCORSEL = 1: 8 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_4</name>
                  <value>0x4</value>
                  <description>If DCORSEL = 0: 5.33 MHz; If DCORSEL = 1: 16 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_5</name>
                  <value>0x5</value>
                  <description>If DCORSEL = 0: 6.67 MHz; If DCORSEL = 1: 21 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_6</name>
                  <value>0x6</value>
                  <description>If DCORSEL = 0: 8 MHz; If DCORSEL = 1: 24 MHz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_7</name>
                  <value>0x7</value>
                  <description>If DCORSEL = 0: Reserved. Defaults to 8. It is not recommended to use this setting; If DCORSEL = 1: Reserved. Defaults to 24. It is not recommended to use this setting</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCORSEL</name>
              <description>[6:6] DCO range select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSCTL2</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>Clock System Control 2</description>
          <fields>
            <field>
              <name>SELM</name>
              <description>[2:0] Selects the MCLK source</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTCLK</name>
                  <value>0x0</value>
                  <description>LFXTCLK when LFXT available, otherwise VLOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <value>0x1</value>
                  <description>VLOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFMODCLK</name>
                  <value>0x2</value>
                  <description>LFMODCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOCLK</name>
                  <value>0x3</value>
                  <description>DCOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODCLK</name>
                  <value>0x4</value>
                  <description>MODCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTCLK</name>
                  <value>0x5</value>
                  <description>HFXTCLK when HFXT available, otherwise DCOCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELS</name>
              <description>[6:4] Selects the SMCLK source</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTCLK</name>
                  <value>0x0</value>
                  <description>LFXTCLK when LFXT available, otherwise VLOCLK.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <value>0x1</value>
                  <description>VLOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFMODCLK</name>
                  <value>0x2</value>
                  <description>LFMODCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOCLK</name>
                  <value>0x3</value>
                  <description>DCOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODCLK</name>
                  <value>0x4</value>
                  <description>MODCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTCLK</name>
                  <value>0x5</value>
                  <description>HFXTCLK when HFXT available, otherwise DCOCLK.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>[10:8] Selects the ACLK source</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTCLK</name>
                  <value>0x0</value>
                  <description>LFXTCLK when LFXT available, otherwise VLOCLK.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <value>0x1</value>
                  <description>VLOCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFMODCLK</name>
                  <value>0x2</value>
                  <description>LFMODCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSCTL3</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>Clock System Control 3</description>
          <fields>
            <field>
              <name>DIVM</name>
              <description>[2:0] MCLK source divider</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>/1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>/2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x2</value>
                  <description>/4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x3</value>
                  <description>/8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x4</value>
                  <description>/16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x5</value>
                  <description>/32</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVS</name>
              <description>[6:4] SMCLK source divider</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>/1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>/2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x2</value>
                  <description>/4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x3</value>
                  <description>/8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x4</value>
                  <description>/16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x5</value>
                  <description>/32</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVA</name>
              <description>[10:8] ACLK source divider</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>/1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>/2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x2</value>
                  <description>/4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x3</value>
                  <description>/8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x4</value>
                  <description>/16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x5</value>
                  <description>/32</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
