lukasl93/msp430fr5994/MSP430FR5994.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PC</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCIN</name>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <description>Port C Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCOUT</name>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <description>Port C Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCDIR</name>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <description>Port C Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCREN</name>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <description>Port C Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCSEL0</name>
          <addressOffset>0x4A</addressOffset>
          <size>16</size>
          <description>Port C Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCSEL1</name>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <description>Port C Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCSELC</name>
          <addressOffset>0x56</addressOffset>
          <size>16</size>
          <description>Port C Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCIES</name>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <description>Port C Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCIE</name>
          <addressOffset>0x5A</addressOffset>
          <size>16</size>
          <description>Port C Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCIFG</name>
          <addressOffset>0x5C</addressOffset>
          <size>16</size>
          <description>Port C Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P5</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P5IV</name>
          <addressOffset>0x4E</addressOffset>
          <size>16</size>
          <description>Port 5 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P5IV</name>
              <description>[4:0] Port 5 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 5.0 interrupt; Interrupt Flag: P5IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 5.1 interrupt; Interrupt Flag: P5IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 5.2 interrupt; Interrupt Flag: P5IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 5.3 interrupt; Interrupt Flag: P5IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 5.4 interrupt; Interrupt Flag: P5IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 5.5 interrupt; Interrupt Flag: P5IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 5.6 interrupt; Interrupt Flag: P5IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 5.7 interrupt; Interrupt Flag: P5IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5IN</name>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <description>Port 5 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5OUT</name>
          <addressOffset>0x42</addressOffset>
          <size>8</size>
          <description>Port 5 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5DIR</name>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <description>Port 5 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5REN</name>
          <addressOffset>0x46</addressOffset>
          <size>8</size>
          <description>Port 5 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5SEL0</name>
          <addressOffset>0x4A</addressOffset>
          <size>8</size>
          <description>Port 5 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5SEL1</name>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <description>Port 5 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5SELC</name>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
          <description>Port 5 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5IES</name>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
          <description>Port 5 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5IE</name>
          <addressOffset>0x5A</addressOffset>
          <size>8</size>
          <description>Port 5 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P5IFG</name>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <description>Port 5 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
