lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>DMACTL2</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>DMA Control 2</description>
          <fields>
            <field>
              <name>DMA4TSEL</name>
              <description>[4:0] DMA trigger select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA4TRIG0</name>
                  <value>0x0</value>
                  <description>DMA4TRIG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG1</name>
                  <value>0x1</value>
                  <description>DMA4TRIG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG2</name>
                  <value>0x2</value>
                  <description>DMA4TRIG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG3</name>
                  <value>0x3</value>
                  <description>DMA4TRIG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG4</name>
                  <value>0x4</value>
                  <description>DMA4TRIG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG5</name>
                  <value>0x5</value>
                  <description>DMA4TRIG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG6</name>
                  <value>0x6</value>
                  <description>DMA4TRIG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG7</name>
                  <value>0x7</value>
                  <description>DMA4TRIG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG8</name>
                  <value>0x8</value>
                  <description>DMA4TRIG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG9</name>
                  <value>0x9</value>
                  <description>DMA4TRIG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG10</name>
                  <value>0xA</value>
                  <description>DMA4TRIG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG11</name>
                  <value>0xB</value>
                  <description>DMA4TRIG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG12</name>
                  <value>0xC</value>
                  <description>DMA4TRIG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG13</name>
                  <value>0xD</value>
                  <description>DMA4TRIG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG14</name>
                  <value>0xE</value>
                  <description>DMA4TRIG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG15</name>
                  <value>0xF</value>
                  <description>DMA4TRIG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG16</name>
                  <value>0x10</value>
                  <description>DMA4TRIG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG17</name>
                  <value>0x11</value>
                  <description>DMA4TRIG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG18</name>
                  <value>0x12</value>
                  <description>DMA4TRIG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG19</name>
                  <value>0x13</value>
                  <description>DMA4TRIG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG20</name>
                  <value>0x14</value>
                  <description>DMA4TRIG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG21</name>
                  <value>0x15</value>
                  <description>DMA4TRIG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG22</name>
                  <value>0x16</value>
                  <description>DMA4TRIG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG23</name>
                  <value>0x17</value>
                  <description>DMA4TRIG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG24</name>
                  <value>0x18</value>
                  <description>DMA4TRIG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG25</name>
                  <value>0x19</value>
                  <description>DMA4TRIG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG26</name>
                  <value>0x1A</value>
                  <description>DMA4TRIG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG27</name>
                  <value>0x1B</value>
                  <description>DMA4TRIG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG28</name>
                  <value>0x1C</value>
                  <description>DMA4TRIG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG29</name>
                  <value>0x1D</value>
                  <description>DMA4TRIG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG30</name>
                  <value>0x1E</value>
                  <description>DMA4TRIG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4TRIG31</name>
                  <value>0x1F</value>
                  <description>DMA4TRIG31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA5TSEL</name>
              <description>[12:8] DMA trigger select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA5TRIG0</name>
                  <value>0x0</value>
                  <description>DMA5TRIG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG1</name>
                  <value>0x1</value>
                  <description>DMA5TRIG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG2</name>
                  <value>0x2</value>
                  <description>DMA5TRIG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG3</name>
                  <value>0x3</value>
                  <description>DMA5TRIG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG4</name>
                  <value>0x4</value>
                  <description>DMA5TRIG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG5</name>
                  <value>0x5</value>
                  <description>DMA5TRIG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG6</name>
                  <value>0x6</value>
                  <description>DMA5TRIG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG7</name>
                  <value>0x7</value>
                  <description>DMA5TRIG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG8</name>
                  <value>0x8</value>
                  <description>DMA5TRIG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG9</name>
                  <value>0x9</value>
                  <description>DMA5TRIG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG10</name>
                  <value>0xA</value>
                  <description>DMA5TRIG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG11</name>
                  <value>0xB</value>
                  <description>DMA5TRIG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG12</name>
                  <value>0xC</value>
                  <description>DMA5TRIG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG13</name>
                  <value>0xD</value>
                  <description>DMA5TRIG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG14</name>
                  <value>0xE</value>
                  <description>DMA5TRIG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG15</name>
                  <value>0xF</value>
                  <description>DMA5TRIG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG16</name>
                  <value>0x10</value>
                  <description>DMA5TRIG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG17</name>
                  <value>0x11</value>
                  <description>DMA5TRIG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG18</name>
                  <value>0x12</value>
                  <description>DMA5TRIG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG19</name>
                  <value>0x13</value>
                  <description>DMA5TRIG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG20</name>
                  <value>0x14</value>
                  <description>DMA5TRIG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG21</name>
                  <value>0x15</value>
                  <description>DMA5TRIG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG22</name>
                  <value>0x16</value>
                  <description>DMA5TRIG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG23</name>
                  <value>0x17</value>
                  <description>DMA5TRIG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG24</name>
                  <value>0x18</value>
                  <description>DMA5TRIG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG25</name>
                  <value>0x19</value>
                  <description>DMA5TRIG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG26</name>
                  <value>0x1A</value>
                  <description>DMA5TRIG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG27</name>
                  <value>0x1B</value>
                  <description>DMA5TRIG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG28</name>
                  <value>0x1C</value>
                  <description>DMA5TRIG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG29</name>
                  <value>0x1D</value>
                  <description>DMA5TRIG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG30</name>
                  <value>0x1E</value>
                  <description>DMA5TRIG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5TRIG31</name>
                  <value>0x1F</value>
                  <description>DMA5TRIG31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL4</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>DMA Control 4</description>
          <fields>
            <field>
              <name>ENNMI</name>
              <description>[0:0] Enable NMI</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENNMI_0</name>
                  <value>0x0</value>
                  <description>NMI does not interrupt DMA transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENNMI_1</name>
                  <value>0x1</value>
                  <description>NMI interrupts a DMA transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROUNDROBIN</name>
              <description>[1:1] Round robin</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROUNDROBIN_0</name>
                  <value>0x0</value>
                  <description>DMA channel priority is DMA0-DMA1-DMA2 - ... - DMA7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROUNDROBIN_1</name>
                  <value>0x1</value>
                  <description>DMA channel priority changes with each transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMARMWDIS</name>
              <description>[2:2] Read-modify-write disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMARMWDIS_0</name>
                  <value>0x0</value>
                  <description>DMA transfers can occur during read-modify-write CPU operations</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMARMWDIS_1</name>
                  <value>0x1</value>
                  <description>DMA transfers inhibited during read-modify-write CPU operations</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAIV</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>DMA Interrupt Vector</description>
          <fields>
            <field>
              <name>DMAIV</name>
              <description>[15:0] DMA interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0IFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: DMA channel 0; Interrupt Flag: DMA0IFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1IFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: DMA channel 1; Interrupt Flag: DMA1IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2IFG</name>
                  <value>0x6</value>
                  <description>Interrupt Source: DMA channel 2; Interrupt Flag: DMA2IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3IFG</name>
                  <value>0x8</value>
                  <description>Interrupt Source: DMA channel 3; Interrupt Flag: DMA3IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA4IFG</name>
                  <value>0xA</value>
                  <description>Interrupt Source: DMA channel 4; Interrupt Flag: DMA4IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA5IFG</name>
                  <value>0xC</value>
                  <description>Interrupt Source: DMA channel 5; Interrupt Flag: DMA5IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA6IFG</name>
                  <value>0xE</value>
                  <description>Interrupt Source: DMA channel 6; Interrupt Flag: DMA6IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA7IFG</name>
                  <value>0x10</value>
                  <description>Interrupt Source: DMA channel 7; Interrupt Flag: DMA7IFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
