lukasl93/msp430fr5994/MSP430FR5994.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMM</name>
      <baseAddress>0x0120</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMMCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>PMM control register 0</description>
          <fields>
            <field>
              <name>PMMSWBOR</name>
              <description>[2:2] Software brownout reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMSWBOR_0</name>
                  <value>0x0</value>
                  <description>Normal operation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR_1</name>
                  <value>0x1</value>
                  <description>Set to 1 to trigger a BOR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMSWPOR</name>
              <description>[3:3] Software POR.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMSWPOR_0</name>
                  <value>0x0</value>
                  <description>Normal operation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR_1</name>
                  <value>0x1</value>
                  <description>Set to 1 to trigger a POR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMREGOFF</name>
              <description>[4:4] Regulator off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMREGOFF_0</name>
                  <value>0x0</value>
                  <description>Regulator remains on when going into LPM3 or LPM4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMREGOFF_1</name>
                  <value>0x1</value>
                  <description>Regulator is turned off when going to LPM3 or LPM4. System enters LPM3.5 or LPM4.5, respectively.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSHE</name>
              <description>[6:6] High-side SVS enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSHE_0</name>
                  <value>0x0</value>
                  <description>High-side SVS (SVSH) is disabled in LPM2, LPM3, LPM4, LPM3.5, and LPM4.5. SVSH is always enabled in active mode, LPM0, and LPM1.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHE_1</name>
                  <value>0x1</value>
                  <description>SVSH is always enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMPW</name>
              <description>[15:8] PMM password.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMMIFG</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>PMM interrupt flag register</description>
          <fields>
            <field>
              <name>PMMBORIFG</name>
              <description>[8:8] PMM software brownout reset interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMBORIFG_0</name>
                  <value>0x0</value>
                  <description>Reset not due to PMMSWBOR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMBORIFG_1</name>
                  <value>0x1</value>
                  <description>Reset due to PMMSWBOR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMRSTIFG</name>
              <description>[9:9] PMM reset pin interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMBORIFG_0</name>
                  <value>0x0</value>
                  <description>Reset not due to reset pin</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMBORIFG_1</name>
                  <value>0x1</value>
                  <description>Reset due to reset pin</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMPORIFG</name>
              <description>[10:10] PMM software POR interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMBORIFG_0</name>
                  <value>0x0</value>
                  <description>Reset not due to PMMSWPOR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMBORIFG_1</name>
                  <value>0x1</value>
                  <description>Reset due to PMMSWPOR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSHIFG</name>
              <description>[13:13] High-side SVS interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSHIFG_0</name>
                  <value>0x0</value>
                  <description>Reset not due to SVSH</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG_1</name>
                  <value>0x1</value>
                  <description>Reset due to SVSH</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMLPM5IFG</name>
              <description>[15:15] LPMx.5 flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMLPM5IFG_0</name>
                  <value>0x0</value>
                  <description>Reset not due to wake-up from LPMx.5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMLPM5IFG_1</name>
                  <value>0x1</value>
                  <description>Reset due to wake-up from LPMx.5</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PM5CTL0</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>Power mode 5 control register 0</description>
          <fields>
            <field>
              <name>LOCKLPM5</name>
              <description>[0:0] LPMx.5 Lock Bit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKLPM5_0</name>
                  <value>0x0</value>
                  <description>LPMx.5 configuration is not locked and defaults to its reset condition.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKLPM5_1</name>
                  <value>0x1</value>
                  <description>LPMx.5 configuration remains locked. Pin state is held during LPMx.5 entry and exit.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
