lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>RTCPS1CTL</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Prescale Timer 1 Control Register</description>
          <fields>
            <field>
              <name>RT1PSIFG</name>
              <description>[0:0] Prescale timer 1 interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1PSIFG_0</name>
                  <value>0x0</value>
                  <description>No time event occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSIFG_1</name>
                  <value>0x1</value>
                  <description>Time event occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1PSIE</name>
              <description>[1:1] Prescale timer 1 interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupt not enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupt enabled (LPM3/LPM3.5 wake-up enabled)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1IP</name>
              <description>[4:2] Prescale timer 1 interrupt interval</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x0</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x3</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x4</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x5</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x6</value>
                  <description>Divide by 128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x7</value>
                  <description>Divide by 256</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1PSHOLD</name>
              <description>[8:8] Prescale timer 1 hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1PSHOLD_0</name>
                  <value>0x0</value>
                  <description>RT1PS is operational</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSHOLD_1</name>
                  <value>0x1</value>
                  <description>RT1PS is held</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1PSDIV</name>
              <description>[13:11] Prescale timer 1 clock divide</description>
              <bitWidth>3</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x0</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x3</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x4</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x5</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x6</value>
                  <description>Divide by 128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x7</value>
                  <description>Divide by 256</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1SSEL</name>
              <description>[15:14] Prescale timer 1 clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1SSEL_0</name>
                  <value>0x0</value>
                  <description>32-kHz crystal oscillator clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1SSEL_1</name>
                  <value>0x1</value>
                  <description>32-kHz crystal oscillator clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PS</name>
                  <value>0x2</value>
                  <description>Output from RT0PS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PS</name>
                  <value>0x3</value>
                  <description>Output from RT0PS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCPS</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Prescale Timer Counter Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCIV</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Interrupt Vector Register</description>
          <fields>
            <field>
              <name>RTCIV</name>
              <description>[15:0] Real-time clock interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCOFIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: RTC oscillator failure; Interrupt Flag: RTCOFIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCRDYIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: RTC ready; Interrupt Flag: RTCRDYIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEVIFG</name>
                  <value>0x6</value>
                  <description>Interrupt Source: RTC interval timer; Interrupt Flag: RTCTEVIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCAIFG</name>
                  <value>0x8</value>
                  <description>Interrupt Source: RTC user alarm; Interrupt Flag: RTCAIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSIFG</name>
                  <value>0xA</value>
                  <description>Interrupt Source: RTC prescaler 0; Interrupt Flag: RT0PSIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSIFG</name>
                  <value>0xC</value>
                  <description>Interrupt Source: RTC prescaler 1; Interrupt Flag: RT1PSIFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTIM0</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>RTCTIM0 Register  Hexadecimal Format</description>
          <fields>
            <field>
              <name>SECONDS</name>
              <description>[5:0] Seconds (0 to 59)</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MINUTES</name>
              <description>[13:8] Minutes (0 to 59)</description>
              <bitWidth>6</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTIM0_BCD</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Seconds, Minutes Register - BCD Format</description>
          <fields>
            <field>
              <name>SECONDSLOWDIGIT</name>
              <description>[3:0] Seconds  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>SECONDSHIGHDIGIT</name>
              <description>[6:4] Seconds  high digit (0 to 5)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MINUTESLOWDIGIT</name>
              <description>[11:8] Minutes  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MINUTESHIGHDIGIT</name>
              <description>[14:12] Minutes  high digit (0 to 5)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCNT12</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Counter 1 and 2  Register  Counter Mode</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTIM1</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Hour, Day of Week</description>
          <fields>
            <field>
              <name>HOURS</name>
              <description>[4:0] Hours (0 to 23)</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DAYOFWEEK</name>
              <description>[10:8] Day of week (0 to 6)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTIM1_BCD</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Hour, Day of Week - BCD Format</description>
          <fields>
            <field>
              <name>HOURSLOWDIGIT</name>
              <description>[3:0] Hours  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>HOURSHIGHDIGIT</name>
              <description>[5:4] Hours  high digit (0 to 2)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DAYOFWEEK</name>
              <description>[10:8] Day of week (0 to 6)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCNT34</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Counter 3 and 4  Register  Counter Mode</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCDATE</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <description>RTCDATE - Hexadecimal Format</description>
          <fields>
            <field>
              <name>DAY</name>
              <description>[4:0] Day of month (1 to 28, 29, 30, 31)</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MONTH</name>
              <description>[11:8] Month (1 to 12)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCDATE_BCD</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Date - BCD Format</description>
          <fields>
            <field>
              <name>DAYLOWDIGIT</name>
              <description>[3:0] Day of month  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DAYHIGHDIGIT</name>
              <description>[5:4] Day of month  high digit (0 to 3)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MONTHLOWDIGIT</name>
              <description>[11:8] Month  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MONTHHIGHDIGIT</name>
              <description>[12:12] Month  high digit (0 or 1)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCYEAR</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>RTCYEAR Register  Hexadecimal Format</description>
          <fields>
            <field>
              <name>YEARLOWBYTE</name>
              <description>[7:0] Year  low byte. Valid values for Year are 0 to 4095.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>YEARHIGHBYTE</name>
              <description>[11:8] Year  high byte. Valid values for Year are 0 to 4095.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCYEAR_BCD</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Year Register - BCD Format</description>
          <fields>
            <field>
              <name>YEAR</name>
              <description>[3:0] Year  lowest digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DECADE</name>
              <description>[7:4] Decade (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CENTURYLOWDIGIT</name>
              <description>[11:8] Century  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CENTURYHIGHDIGIT</name>
              <description>[14:12] Century  high digit (0 to 4)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCAMINHR</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>RTCMINHR - Hexadecimal Format</description>
          <fields>
            <field>
              <name>MIN</name>
              <description>[5:0] Minutes (0 to 59)</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MINAE</name>
              <description>[7:7] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>HOUR</name>
              <description>[12:8] Hours (0 to 23)</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HOURAE</name>
              <description>[15:15] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCAMINHR_BCD</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Minutes, Hour Alarm - BCD Format</description>
          <fields>
            <field>
              <name>MINUTESLOWDIGIT</name>
              <description>[3:0] Minutes  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MINUTESHIGHDIGIT</name>
              <description>[6:4] Minutes  high digit (0 to 5)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MINAE</name>
              <description>[7:7] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>HOURSLOWDIGIT</name>
              <description>[11:8] Hours  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HOURSHIGHDIGIT</name>
              <description>[13:12] Hours  high digit (0 to 2)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>HOURAE</name>
              <description>[15:15] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCADOWDAY</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>RTCADOWDAY - Hexadecimal Format</description>
          <fields>
            <field>
              <name>DOW</name>
              <description>[2:0] Day of week (0 to 6)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DOWAE</name>
              <description>[7:7] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DAY</name>
              <description>[12:8] Day of month (1 to 28, 29, 30, 31)</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DAYAE</name>
              <description>[15:15] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
