lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>RTCADOWDAY_BCD</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>Real-Time Clock Day of Week, Day of Month Alarm - BCD Format</description>
          <fields>
            <field>
              <name>DOW</name>
              <description>[2:0] Day of week (0 to 6)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DOWAE</name>
              <description>[7:7] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DAY_LD</name>
              <description>[11:8] Day of month  low digit (0 to 9)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DAY_HD</name>
              <description>[13:12] Day of month  high digit (0 to 3)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DAYAE</name>
              <description>[15:15] Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BIN2BCD</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>Binary-to-BCD Conversion Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BCD2BIN</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>BCD-to-Binary Conversion Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RT0PS</name>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <description>Prescale timer 0 counter value</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RT1PS</name>
          <addressOffset>0xD</addressOffset>
          <size>8</size>
          <description>Prescale timer 1 counter value</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCNT1</name>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <description>The RTCCNT1 register is the count of RTCCNT1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCNT2</name>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <description>The RTCCNT2 register is the count of RTCCNT2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCNT3</name>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
          <description>The RTCCNT3 register is the count of RTCCNT3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCCNT4</name>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
          <description>The RTCCNT4 register is the count of RTCCNT4</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SFR</name>
      <baseAddress>0x0100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SFRIE1</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Interrupt Enable</description>
          <fields>
            <field>
              <name>WDTIE</name>
              <description>[0:0] Watchdog timer interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupts disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupts enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFIE</name>
              <description>[1:1] Oscillator fault interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupts disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupts enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VMAIE</name>
              <description>[3:3] Vacant memory access interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupts disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupts enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMIIE</name>
              <description>[4:4] NMI pin interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupts disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupts enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBINIE</name>
              <description>[6:6] JTAG mailbox input interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupts disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupts enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBOUTIE</name>
              <description>[7:7] JTAG mailbox output interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Interrupts disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Interrupts enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SFRIFG1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Interrupt Flag</description>
          <fields>
            <field>
              <name>OFIFG</name>
              <description>[1:1] Oscillator fault interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VMAIFG</name>
              <description>[3:3] Vacant memory access interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VMAIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VMAIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMIIFG</name>
              <description>[4:4] NMI pin interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NMIIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMIIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTIFG</name>
              <description>[0:0] Watchdog timer interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBINIFG</name>
              <description>[6:6] JTAG mailbox input interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBINIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending. When in 16-bit mode (JMBMODE = 0), this bit is cleared automatically when JMBI0 is read by the CPU. When in 32-bit mode (JMBMODE = 1), this bit is cleared automatically when both JMBI0 and JMBI1 have been read by the CPU. This bit is also cleared when the associated vector in SYSUNIV has been read</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBINIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending. A message is waiting in the JMBIN registers. In 16-bit mode (JMBMODE = 0) when JMBI0 has been written by the JTAG module. In 32-bit mode (JMBMODE = 1) when JMBI0 and JMBI1 have been written by the JTAG module.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBOUTIFG</name>
              <description>[7:7] JTAG mailbox output interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBOUTIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending. When in 16-bit mode (JMBMODE = 0), this bit is cleared automatically when JMBO0 has been written with a new message to the JTAG module by the CPU. When in 32-bit mode (JMBMODE = 1), this bit is cleared automatically when both JMBO0 and JMBO1 have been written with new messages to the JTAG module by the CPU. This bit is also cleared when the associated vector in SYSUNIV has been read.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBOUTIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending. JMBO registers are ready for new messages. In 16-bit mode (JMBMODE = 0), JMBO0 has been received by the JTAG module and is ready for a new message from the CPU. In 32-bit mode (JMBMODE = 1), JMBO0 and JMBO1 have been received by the JTAG module and are ready for new messages from the CPU.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SFRRPCR</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>Reset Pin Control</description>
          <fields>
            <field>
              <name>SYSNMI</name>
              <description>[0:0] NMI select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <value>0x0</value>
                  <description>Reset function</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMI</name>
                  <value>0x1</value>
                  <description>NMI function</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSNMIIES</name>
              <description>[1:1] NMI edge select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>0x0</value>
                  <description>NMI on rising edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0x1</value>
                  <description>NMI on falling edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRSTUP</name>
              <description>[2:2] Reset resistor pin pullup or pulldown</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULLDOWN</name>
                  <value>0x0</value>
                  <description>Pulldown is selected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLUP</name>
                  <value>0x1</value>
                  <description>Pullup is selected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRSTRE</name>
              <description>[3:3] Reset pin resistor enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Pullup or pulldown resistor at the RST/NMI pin is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Pullup or pulldown resistor at the RST/NMI pin is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
