lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>TA4IV</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>TimerAx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>TAIV</name>
              <description>[15:0] TimerA interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR1</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TAxCCR1 CCIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR2</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TAxCCR2 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR3</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TAxCCR3 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR4</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TAxCCR4 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR5</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TAxCCR5 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR6</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TAxCCR6 CCIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIFG</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TAxCTL TAIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TB0</name>
      <baseAddress>0x03C0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TB0CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Timer_B Control Register</description>
          <fields>
            <field>
              <name>TBIFG</name>
              <description>[0:0] TimerB interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBIE</name>
              <description>[1:1] TimerB interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCLR</name>
              <description>[2:2] TimerB clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MC</name>
              <description>[5:4] Mode control</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <value>0x0</value>
                  <description>Stop mode: Timer is halted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>0x1</value>
                  <description>Up mode: Timer counts up to TBxCL0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <value>0x2</value>
                  <description>Continuous mode: Timer counts up to the value set by CNTL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN</name>
                  <value>0x3</value>
                  <description>Up/down mode: Timer counts up to TBxCL0 then down to 0000h</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>[7:6] Input divider</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>/1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>0x1</value>
                  <description>/2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x2</value>
                  <description>/4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x3</value>
                  <description>/8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBSSEL</name>
              <description>[9:8] TimerB clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBCLK</name>
                  <value>0x0</value>
                  <description>TBxCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <value>0x1</value>
                  <description>ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <value>0x2</value>
                  <description>SMCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLK</name>
                  <value>0x3</value>
                  <description>INCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTL</name>
              <description>[12:11] Counter length</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x0</value>
                  <description>16-bit, TBxR(max) = 0FFFFh</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <value>0x1</value>
                  <description>12-bit, TBxR(max) = 0FFFh</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <value>0x2</value>
                  <description>10-bit, TBxR(max) = 03FFh</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x3</value>
                  <description>8-bit, TBxR(max) = 0FFh</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCLGRP</name>
              <description>[14:13] TBxCLn group</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBCLGRP_0</name>
                  <value>0x0</value>
                  <description>Each TBxCLn latch loads independently</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_1</name>
                  <value>0x1</value>
                  <description>TBxCL1+TBxCL2 (TBxCCR1 CLLD bits control the update); TBxCL3+TBxCL4 (TBxCCR3 CLLD bits control the update); TBxCL5+TBxCL6 (TBxCCR5 CLLD bits control the update); TBxCL0 independent</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_2</name>
                  <value>0x2</value>
                  <description>TBxCL1+TBxCL2+TBxCL3 (TBxCCR1 CLLD bits control the update); TBxCL4+TBxCL5+TBxCL6 (TBxCCR4 CLLD bits control the update); TBxCL0 independent</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_3</name>
                  <value>0x3</value>
                  <description>TBxCL0+TBxCL1+TBxCL2+TBxCL3+TBxCL4+TBxCL5+TBxCL6 (TBxCCR1 CLLD bits control the update)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB0CCTL0</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Timer_B Capture/Compare Control Register</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture overflow</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COV_0</name>
                  <value>0x0</value>
                  <description>No capture overflow occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COV_1</name>
                  <value>0x1</value>
                  <description>Capture overflow occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] Output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x0</value>
                  <description>Output low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                  <description>Output high</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture/compare input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0x0</value>
                  <description>OUT bit value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>0x1</value>
                  <description>Set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>0x2</value>
                  <description>Toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>0x3</value>
                  <description>Set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>0x4</value>
                  <description>Toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>0x5</value>
                  <description>Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>0x6</value>
                  <description>Toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>0x7</value>
                  <description>Reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <value>0x0</value>
                  <description>Compare mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <value>0x1</value>
                  <description>Capture mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLLD</name>
              <description>[10:9] Compare latch load</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <value>0x0</value>
                  <description>TBxCLn loads on write to TBxCCRn</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <value>0x1</value>
                  <description>TBxCLn loads when TBxR counts to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <value>0x2</value>
                  <description>TBxCLn loads when TBxR counts to 0 (up or continuous mode). TBxCLn loads when TBxR counts to TBxCL0 or to 0 (up/down mode).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <value>0x3</value>
                  <description>TBxCLn loads when TBxR counts to TBxCLn</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Synchronize capture source</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <value>0x0</value>
                  <description>Asynchronous capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <value>0x1</value>
                  <description>Synchronous capture</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture/compare input select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIA</name>
                  <value>0x0</value>
                  <description>CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIB</name>
                  <value>0x1</value>
                  <description>CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <value>0x2</value>
                  <description>GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC</name>
                  <value>0x3</value>
                  <description>VCC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No capture</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>0x1</value>
                  <description>Capture on rising edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0x2</value>
                  <description>Capture on falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x3</value>
                  <description>Capture on both rising and falling edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
