lukasl93/msp430fr5994/MSP430FR5994.svd
        <register>
          <name>UCA2STATW</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Status Register</description>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>[0:0] eUSCI_A busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>0x0</value>
                  <description>eUSCI_A inactive</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <value>0x1</value>
                  <description>eUSCI_A transmitting or receiving</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCADDR_UCIDLE</name>
              <description>[1:1] Address received / Idle line detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCRXERR</name>
              <description>[2:2] Receive error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXERR_0</name>
                  <value>0x0</value>
                  <description>No receive errors detected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXERR_1</name>
                  <value>0x1</value>
                  <description>Receive error detected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRK</name>
              <description>[3:3] Break detect flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRK_0</name>
                  <value>0x0</value>
                  <description>No break condition</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRK_1</name>
                  <value>0x1</value>
                  <description>Break condition occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCPE</name>
              <description>[4:4] Parity error flag. When UCPEN = 0, UCPE is read as 0. UCPE is cleared when UCAxRXBUF is read.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCPE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCPE_1</name>
                  <value>0x1</value>
                  <description>Character received with parity error</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCOE</name>
              <description>[5:5] Overrun error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOE_1</name>
                  <value>0x1</value>
                  <description>Overrun error occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCFE</name>
              <description>[6:6] Framing error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCFE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCFE_1</name>
                  <value>0x1</value>
                  <description>Character received with low stop bit</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>[7:7] Listen enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLISTEN_0</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLISTEN_1</name>
                  <value>0x1</value>
                  <description>Enabled. UCAxTXD is internally fed back to the receiver</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2STATW_SPI</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>UCA2STATW_SPI</description>
          <fields>
            <field>
              <name>UCOE</name>
              <description>[5:5] Overrun error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOE_1</name>
                  <value>0x1</value>
                  <description>Overrun error occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCFE</name>
              <description>[6:6] Framing error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCFE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCFE_1</name>
                  <value>0x1</value>
                  <description>Bus conflict occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>[7:7] Listen enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLISTEN_0</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLISTEN_1</name>
                  <value>0x1</value>
                  <description>Enabled. UCAxTXD is internally fed back to the receiver</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2RXBUF</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Receive Buffer Register</description>
          <fields>
            <field>
              <name>UCRXBUF</name>
              <description>[7:0] Receive data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2RXBUF_SPI</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Receive Buffer Register</description>
          <fields>
            <field>
              <name>UCRXBUF</name>
              <description>[7:0] Receive data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2TXBUF</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Transmit Buffer Register</description>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>[7:0] Transmit data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2TXBUF_SPI</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Transmit Buffer Register</description>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>[7:0] Transmit data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2ABCTL</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Auto Baud Rate Control Register</description>
          <fields>
            <field>
              <name>UCABDEN</name>
              <description>[0:0] Automatic baud-rate detect enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCABDEN_0</name>
                  <value>0x0</value>
                  <description>Baud-rate detection disabled. Length of break and synch field is not measured.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCABDEN_1</name>
                  <value>0x1</value>
                  <description>Baud-rate detection enabled. Length of break and synch field is measured and baud-rate settings are changed accordingly.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBTOE</name>
              <description>[2:2] Break time out error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBTOE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBTOE_1</name>
                  <value>0x1</value>
                  <description>Length of break field exceeded 22 bit times</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTOE</name>
              <description>[3:3] Synch field time out error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTOE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTOE_1</name>
                  <value>0x1</value>
                  <description>Length of synch field exceeded measurable time</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCDELIM</name>
              <description>[5:4] Break/synch delimiter length</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCDELIM_0</name>
                  <value>0x0</value>
                  <description>1 bit time</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_1</name>
                  <value>0x1</value>
                  <description>2 bit times</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_2</name>
                  <value>0x2</value>
                  <description>3 bit times</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_3</name>
                  <value>0x3</value>
                  <description>4 bit times</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2IRCTL</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax IrDA Control Word Register</description>
          <fields>
            <field>
              <name>UCIREN</name>
              <description>[0:0] IrDA encoder/decoder enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIREN_0</name>
                  <value>0x0</value>
                  <description>IrDA encoder/decoder disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIREN_1</name>
                  <value>0x1</value>
                  <description>IrDA encoder/decoder enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRTXCLK</name>
              <description>[1:1] IrDA transmit pulse clock select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIRTXCLK_0</name>
                  <value>0x0</value>
                  <description>BRCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIRTXCLK_1</name>
                  <value>0x1</value>
                  <description>BITCLK16 when UCOS16 = 1. Otherwise, BRCLK.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRTXPL</name>
              <description>[7:2] Transmit pulse length</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCIRRXFE</name>
              <description>[8:8] IrDA receive filter enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIRRXFE_0</name>
                  <value>0x0</value>
                  <description>Receive filter disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIRRXFE_1</name>
                  <value>0x1</value>
                  <description>Receive filter enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRRXPL</name>
              <description>[9:9] IrDA receive input UCAxRXD polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x0</value>
                  <description>IrDA transceiver delivers a high pulse when a light pulse is seen</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x1</value>
                  <description>IrDA transceiver delivers a low pulse when a light pulse is seen</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRRXFL</name>
              <description>[15:10] Receive filter length</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2IE</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Interrupt Enable Register</description>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>[0:0] Receive interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>[1:1] Transmit interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTTIE</name>
              <description>[2:2] Start bit interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTTIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXCPTIE</name>
              <description>[3:3] Transmit complete interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXCPTIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXCPTIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA2IE_SPI</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>eUSCI_Ax Interrupt Enable Register</description>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>[0:0] Receive interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>[1:1] Transmit interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
